rulebook-examples/customer-fullname/execution-substrates/rails/app/views/customers/_form.html.erb

SELECT "customers".* FROM "customers" WHERE "customers"."customer_id" = $1 LIMIT $2  [["customer_id", "jane-smith-email-com"], ["LIMIT", 1]]
---
    <label for="customer_first_name">First Name</label>
    <input class="form-control" type="text" value="<%= customer.first_name %>" name="customer[first_name]" id="customer_first_name" />