# Domain Vocabulary — Small Business Banking Client Manager
# Domain-specific terms only, extracted from the README.

# --- Core entities ---
Business
BeneficialOwner
Contact
Account
Loan
Covenant
Document
User
Interaction
RiskRatingHistory

# --- People & roles ---
RelationshipManager
RM
Underwriter
BranchBanker
Admin
Officer
Signer
APClerk
Customer
ControlPerson

# --- Bank context ---
CommunityBank
RegionalBank
Fintech
CoreBanking
JackHenry
FIS
Fiserv

# --- Client management domain ---
BusinessProfile
KYB
Onboarding
InteractionLog
TreasuryServices
Pipeline
Prospect
Referral
CrossSell
Portfolio

# --- Lending & risk domain ---
LoanPipeline
LoanOrigination
LoanApplication
LoanServicing
Inquiry
PreQualification
CreditAnalysis
CreditPull
FinancialStatement
StatementSpreading
DebtServiceCoverageRatio
DSCR
LoanToValue
LTV
GlobalCashFlow
CovenantMonitoring
CovenantBreach
CovenantWaiver
CovenantException
TestSchedule
TicklerCalendar
RiskRating
RiskGrade
RiskGradeMigration
AnnualReview
Watchlist
ClassifiedAsset
CollectionsWorkflow
DelinquencyWorkflow
LossMitigation
PaymentProcessing
UnderwritingStage
CommitteeApproval
ClosingPrep
Signing
Funding

# --- Compliance / regulatory ---
BSA
AML
CDD
KYB
CTR
SAR
OFAC
FFIEC
OCC
FinCEN
HMDA
NAICS
UCC
CECL
ALLL
CallReport
SegregationOfDuties
BeneficialOwnership
SanctionsScreening
TransactionMonitoring
AuditTrail
PII
EncryptedAtRest
FieldLevelEncryption

# --- Accounts & treasury ---
DepositAccount
ACH
Wire
Card
CashManagement
Balance

# --- External integrations ---
CreditBureau
Experian
DnB
Equifax
PublicRecords
SecretaryOfState
UCCLienSearch
CourtRecord
AccountingFeed
QuickBooks
Xero
Plaid
Verafin
RegulatoryReporting

# --- Platform services ---
DocumentVault
OCR
ESignature
ReportingAndAnalytics
PortfolioDashboard
BoardPack
Notification
NotificationChannel
WorkflowEngine
ApprovalRouting
SLA
IdentityAndAccess
SSO
MFA
RoleBasedAccess
SearchAndIndexing
GlobalSearch

# --- Presentation surfaces ---
RMDashboard
BranchBankerPortal
BusinessClientPortal
AdminConsole

# --- Activity / events ---
Note
Call
Visit
Task
Meeting
SystemEvent
InteractionType

# --- Other domain concepts ---
SystemOfRecord
SinglePointOfContact
OwnershipPercentage
ControlPerson
RelationshipDepth
DataResidency
