rulebook-examples/customer-fullname/execution-substrates/rails/app/controllers/customers_controller.rb

  def index
    @customers = Customer.all
---
SELECT "vw_customers".* FROM "vw_customers" WHERE "vw_customers"."customer_id" = $1 LIMIT $2  [["customer_id", "jane-smith-email-com"], ["LIMIT", 1]]

  def update
    if @customer.update(customer_params)
      redirect_to Customer.find(@customer.customer_id), notice: 'Customer was successfully updated.'
---
UPDATE "customers" SET "first_name" = $1 WHERE "customers"."customer_id" = $2  [["first_name", "Janice"], ["customer_id", "jane-smith-email-com"]]
SELECT "vw_customers".* FROM "vw_customers" WHERE "vw_customers"."customer_id" = $1 LIMIT $2  [["customer_id", "jane-smith-email-com"], ["LIMIT", 1]]

  def set_customer_for_view
    @customer = Customer.find(params[:id])
---
SELECT "vw_customers".* FROM "vw_customers" WHERE "vw_customers"."customer_id" = $1 LIMIT $2  [["customer_id", "alice-cooper"], ["LIMIT", 1]]