# Domain Vocabulary — Hitchens vs Turek, "Does God Exist?"
# (Step 2: trimmed from words.txt to domain-specific terms only)
# Re-derived from the full VCU debate transcript. Every term below is attested in raw-input.txt.

## Worldviews & positions
theism
deism
atheism
anti-theism
agnosticism
materialism
humanism
Christianity
naturalism
determinism

## The participants & frame
debate
debater
affirmative
negative
burden-of-proof
opening
rebuttal
cross-examination
closing
moderator
United-Secular-Alliance

## Arguments (named)
cosmological-argument
teleological-argument
design-argument
moral-argument
ontological-argument
argument-from-reason
argument-from-mathematics
argument-from-free-will
argument-from-consciousness
argument-from-fine-tuning
fine-tuning
argument-from-poor-design
problem-of-evil
choice-argument
probability-argument

## Cosmology / the SURGE evidence
big-bang
beginning
beginner
SURGE
second-law-of-thermodynamics
heat-death
entropy
expansion
radiation-echo
cosmic-afterglow
COBE
galaxy
general-relativity
space-time-matter
red-shift
red-light-shift
singularity
event-horizon
black-hole
nothing
eternal
andromeda
gravitational-force
axial-tilt

## Design / information
specified-complexity
information
DNA
irreducible-complexity
panspermia
primordial-soup
natural-selection
random-mutation
macro-evolution
watchmaker
razors-edge
designer
purpose
optimal-design
pandas-thumb

## Moral / epistemic concepts
objective-moral-values
moral-lawgiver
standard-beyond-humanity
prescription
prescriber
is-ought-problem
empathy
conscience
inner-daemon
internal-witness
divine-permission
divine-command
moral-autonomy
enlightenment-values
solipsism

## Theological concepts
creator
spaceless
timeless
immaterial
personal
powerful
intelligent
moral
miracle
parthenogenesis
virgin-birth
resurrection
vicarious-redemption
scapegoating
human-sacrifice
atonement
original-sin
the-fall
good-samaritan
parable-of-the-talents
limbo
hell
heaven
rapture
armageddon
eschatology
apocalypse
cult-of-death
mind-forged-manacles
celestial-dictatorship
totalitarian
theocracy
messianic
master-slave
permission

## Religion, ethics & the body (cross-examination)
abortion
termination-of-pregnancy
contraception
ectopic-pregnancy
fetus
unborn-child
embryology
genital-mutilation
suicide-bombing
amalekites-genocide
circumcision

## Method / reasoning
occams-razor
hume-on-miracles
suspension-of-natural-order
non-overlapping-magisteria
borrowing-from-theism
sit-in-gods-lap
prime-mover

## Thinkers invoked
Hubble
Penzias
Wilson
Smoot
Hawking
Jastrow
Eddington
Einstein
Aristotle
Dawkins
Crick
Hoyle
Wickramasinghe
Flew
Weinberg
Provine
Dennett
Darwin
Paley
Aquinas
Jefferson
Hume
Socrates
Adam-Smith
CS-Lewis
Krauss
Gould
Lemaitre
Mencken
Dostoevsky
Smerdyakov
Pascal
Lucretius
Epicurus
Democritus
Collins
Gladstone
Khayyam
