# Domain Vocabulary — Hitchens vs Turek, "Does God Exist?"
# (Step 2: trimmed from words.txt to domain-specific terms only)

## Worldviews & positions
theism
deism
atheism
anti-theism
agnosticism
materialism
humanism
Christianity
naturalism

## The participants & frame
debate
debater
affirmative
negative
burden-of-proof
opening
rebuttal
cross-examination
closing
moderator

## Arguments (named)
cosmological-argument
teleological-argument
design-argument
moral-argument
ontological-argument
argument-from-reason
argument-from-mathematics
argument-from-free-will
argument-from-consciousness
argument-from-fine-tuning
fine-tuning
argument-from-poor-design
problem-of-evil
choice-argument

## Cosmology / the SURGE evidence
big-bang
beginning
beginner
SURGE
second-law-of-thermodynamics
heat-death
expansion
radiation-echo
cosmic-afterglow
COBE
galaxy
general-relativity
space-time-matter
red-shift
singularity
nothing
eternal
red-light-shift

## Design / information
specified-complexity
information
DNA
panspermia
primordial-soup
natural-selection
random-mutation
macro-evolution
watchmaker
razors-edge
designer
purpose

## Moral / epistemic concepts
objective-moral-values
moral-lawgiver
standard-beyond-humanity
prescription
prescriber
is-ought-problem
empathy
conscience
inner-daemon
internal-witness
divine-permission
divine-command

## Theological concepts
creator
spaceless
timeless
immaterial
personal
powerful
intelligent
moral
miracle
vicarious-redemption
scapegoating
human-sacrifice
virgin-birth
resurrection
limbo
hell
rapture
armageddon
eschatology
apocalypse
cult-of-death
mind-forged-manacles
celestial-dictatorship
totalitarian
master-slave
permission

## Method / reasoning
occams-razor
hume-on-miracles
suspension-of-natural-order
non-overlapping-magisteria
borrowing-from-theism
sit-in-gods-lap

## Thinkers invoked
Hubble
Penzias
Wilson
Smoot
Hawking
Jastrow
Eddington
Einstein
Aristotle
Dawkins
Crick
Hoyle
Wickramasinghe
Flew
Weinberg
Provine
Dennett
Darwin
Paley
Aquinas
Jefferson
Hume
Socrates
Adam-Smith
CS-Lewis
Krauss
Gould
Lemaitre
Mencken
Dostoevsky
Smerdyakov
Pascal
Lucretius
Epicurus
Democritus
